meny = """Главное меню
1. Открыть файл
2. Сохранить файл
3. Показать все контакты
4. Создать новый контакт 
5. Найти контакт
6. Изменить контакт
7. Удалить контакт
8. Выход из меню
"""
event = "Ввидите действие:"
event_1 = "Файл успешно открылся"
error_event_1 = "Файл пустой"
book_error = "Телефонная книга пуста или файл не открыт"

event_2 = "Файл Успешно сохранён"
error_event_2 = "Файл пуст или не открыт сохранить изменение невозможно"

new_name = "Ввидите имя нового контакта:"
new_phone = "Ввидите номер нового контакта:"
new_comment = "Ввидите сообщение к новому контакту:"
event_4 = "Контакт успешно создан"
error_event_4 = "Перед тем как добавить контакт пожалуйста откройте файл"
name_phone_error = "Поле с именем и номером телефона не может быть пустыми попробуйте ещё раз"

event_5 = "Ввидите искомый контакт:"
event_error_5 = "Файл пустой или вы забыли его открыть"
event_error_55 = "Данные отсутствуют"

event_6 = "Ввидите уникальный номер контакта который вы хотите изменить:"
meny_change = """
1.Имя
2.Номер телефона
3.Комментарий
4.Отменить изменения
"""
change = "Что вы хотите изменить:"
variation = "Ввидите изменение:"
event_6_finish = "Контакт успешно изменён"

event_error_6 = "Такого контакта не существует"
event_error_69 = "Такой функции нет"
event_error_66 = "Файл пуст или вы забыли его открыть"
variation_error = "Вы нечего не изменили"


event_7 = "Ввидите уникальный номер контакта который вы хотите удалить:"
event_7_finish = "Контакт удалён"
event_error_7 = "Такого контакта нет или был указан неправильный уникальный номер"

